In [1]:
import numpy as np
import pandas as pd

# Numpy arrays

In [2]:
np.array([1, 2, 3.9, 5, 7])

array([1. , 2. , 3.9, 5. , 7. ])

In [3]:
np.array(2)

array(2)

In [4]:
type(np.array(2))

numpy.ndarray

In [5]:
data1 = [6, 7.7, 8, 0, 1]
np.array(data1, dtype=int)

array([6, 7, 8, 0, 1])

In [6]:
data2 = [[1, 2, 3, 4], [5, 6, 7, 8]]
np.array(data2)

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [7]:
np.zeros(10)

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [8]:
np.zeros(10, dtype=int)

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [9]:
np.ones(10)

array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1.])

In [10]:
arr1 = np.ones((3,6))
# a tuple for rows and columns
arr1

array([[1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1.]])

In [11]:
arr1.shape

(3, 6)

In [12]:
len(arr1)

3

In [13]:
arr1.shape[0]

3

In [14]:
np.empty((3,2), dtype=int)

array([[ 3458764513820540928, -1152912720694840368],
       [                   3,                    0],
       [                   0,      844424930131968]])

In [15]:
np.eye(2, 3, dtype=int)

array([[1, 0, 0],
       [0, 1, 0]])

In [16]:
np.arange(10.5, dtype=int)

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [17]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [283]:
%matplotlib notebook
import matplotlib.pyplot as plt
plt.plot(np.arange(10,20))

In [18]:
np.arange(10.,20.)

array([10., 11., 12., 13., 14., 15., 16., 17., 18., 19.])

In [19]:
np.arange(10,20)

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19])

In [20]:
np.arange(10,20).reshape(2,5)

array([[10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [21]:
np.arange(10,110, 20)       # (from,to, spacing), returns int, end EX-clusive

array([10, 30, 50, 70, 90])

In [22]:
np.linspace(10,110, 11)     # (from,to, counts), returns float, both ends In-clusive!

array([ 10.,  20.,  30.,  40.,  50.,  60.,  70.,  80.,  90., 100., 110.])

In [23]:
np.random.randn(4)
# this returns a range of numbers in an ndarray

array([-0.85399333,  0.41752663, -0.14963776,  1.98005697])

In [24]:
np.random.randn(3, 2)       # (row counts, column counts)
#help(np.random.randn)

array([[-1.28954443,  1.2815355 ],
       [ 0.60703066,  1.1420186 ],
       [-1.14884681, -0.39616566]])

In [25]:
np.random.randint(96)       # (from,to, (row counts, column counts))
# this returns a number in a range

42

In [26]:
# again, a number in a range:

In [27]:
np.random.randint(18,96)

27

In [28]:
np.random.randint(18,96, size=(2,3))

array([[37, 94, 82],
       [41, 35, 58]])

In [29]:
# need to give an ndarray size as a tuple in randint!
# help(np.random.randint)

In [30]:
while True:
    max_randint = np.random.randint(18,96)
    if max_randint >= 95:
        break
print(max_randint)

95

In [31]:
# so...randint ends are non-inclusice
#help(np.random.randint)

In [32]:
arr2 = np.random.randint(5,10, (5,7))
arr2

array([[9, 6, 8, 8, 5, 9, 6],
       [6, 7, 7, 5, 7, 9, 7],
       [7, 7, 9, 5, 6, 5, 6],
       [7, 7, 7, 6, 6, 8, 5],
       [7, 6, 5, 9, 9, 9, 7]])

In [33]:
np.random.randint(5,10, 7)

array([8, 9, 9, 6, 6, 5, 5])

In [34]:
arr2[1:4]

array([[6, 7, 7, 5, 7, 9, 7],
       [7, 7, 9, 5, 6, 5, 6],
       [7, 7, 7, 6, 6, 8, 5]])

In [35]:
arr2[4:] = 3
arr2

array([[9, 6, 8, 8, 5, 9, 6],
       [6, 7, 7, 5, 7, 9, 7],
       [7, 7, 9, 5, 6, 5, 6],
       [7, 7, 7, 6, 6, 8, 5],
       [3, 3, 3, 3, 3, 3, 3]])

In [36]:
arr2[2][3]

5

In [37]:
arr2[2, 3]

5

In [38]:
arr2[2:4, 3:6]

array([[5, 6, 5],
       [6, 6, 8]])

In [39]:
arr2[2:4][3:6]      # this actually selects rows 3-5 of 
                    # the sliced rows 2-3 of arr2, which are outside/nothing

array([], shape=(0, 7), dtype=int64)

In [40]:
arr2[2:4][:]        # this then selects all the rows of the sliced rows 2-3

array([[7, 7, 9, 5, 6, 5, 6],
       [7, 7, 7, 6, 6, 8, 5]])

In [41]:
arr2[2:4][:, 3:6]   # and then select the desired columns 3-5

array([[5, 6, 5],
       [6, 6, 8]])

In [42]:
arr3 = np.array(['Bob', 'Joe', 'Will', 'Bob', 'Will', 'Joe', 'Joe'])
arr3

array(['Bob', 'Joe', 'Will', 'Bob', 'Will', 'Joe', 'Joe'], dtype='<U4')

In [43]:
data0 = np.random.randn(7,7)
data0

array([[ 1.06986682, -1.46741507,  0.70455169, -0.68032918, -0.62540507,
         0.53950591, -0.27911247],
       [ 0.22105058, -0.88532963,  0.4769203 , -0.45815351, -1.37542517,
         1.57029467, -0.38025971],
       [ 0.69869846,  0.50299885, -0.08912894,  0.67960704, -0.80273425,
         0.38533151,  0.3204486 ],
       [-0.07805039,  0.57092228, -2.3405982 ,  0.2418273 , -1.11036526,
        -1.01531973, -2.26353391],
       [ 0.47763279, -0.2795806 , -0.70290448, -0.17173549,  0.6389993 ,
         2.01103554, -0.10833858],
       [-0.48702496, -0.60586811, -1.0944216 ,  1.00991892,  0.45684489,
        -3.39359134,  0.20570953],
       [-0.39753332,  0.20466921,  1.0220389 , -2.30256387,  0.17757577,
        -1.97025328,  0.96037975]])

In [44]:
arr3 == 'Bob'

array([ True, False, False,  True, False, False, False])

In [45]:
data0[arr3 == 'Bob']     # this returns the 0th and 3rd rows
                         # dimensions (7) must match for indexing to work!

array([[ 1.06986682, -1.46741507,  0.70455169, -0.68032918, -0.62540507,
         0.53950591, -0.27911247],
       [-0.07805039,  0.57092228, -2.3405982 ,  0.2418273 , -1.11036526,
        -1.01531973, -2.26353391]])

In [46]:
data0[arr3 == 'Bob', 2:]

array([[ 0.70455169, -0.68032918, -0.62540507,  0.53950591, -0.27911247],
       [-2.3405982 ,  0.2418273 , -1.11036526, -1.01531973, -2.26353391]])

In [47]:
data0[2:, arr3 == 'Bob']

array([[ 0.69869846,  0.67960704],
       [-0.07805039,  0.2418273 ],
       [ 0.47763279, -0.17173549],
       [-0.48702496,  1.00991892],
       [-0.39753332, -2.30256387]])

In [48]:
for i in range(7):
    data0[i] = i
    data0.dtype = int
data0

array([[0, 0, 0, 0, 0, 0, 0],
       [1, 1, 1, 1, 1, 1, 1],
       [2, 2, 2, 2, 2, 2, 2],
       [3, 3, 3, 3, 3, 3, 3],
       [4, 4, 4, 4, 4, 4, 4],
       [5, 5, 5, 5, 5, 5, 5],
       [6, 6, 6, 6, 6, 6, 6]])

In [49]:
for i in range(7):
    data0[i,i] = 99
data0

array([[99,  0,  0,  0,  0,  0,  0],
       [ 1, 99,  1,  1,  1,  1,  1],
       [ 2,  2, 99,  2,  2,  2,  2],
       [ 3,  3,  3, 99,  3,  3,  3],
       [ 4,  4,  4,  4, 99,  4,  4],
       [ 5,  5,  5,  5,  5, 99,  5],
       [ 6,  6,  6,  6,  6,  6, 99]])

In [50]:
data0[[5,2,0]]         # sub a list of rows

array([[ 5,  5,  5,  5,  5, 99,  5],
       [ 2,  2, 99,  2,  2,  2,  2],
       [99,  0,  0,  0,  0,  0,  0]])

In [51]:
data0.take([5,2,0])    # by default this takes itmes from the first (0th) row

array([ 0,  0, 99])

In [52]:
data0.take([5,2,0], axis=0)

array([[ 5,  5,  5,  5,  5, 99,  5],
       [ 2,  2, 99,  2,  2,  2,  2],
       [99,  0,  0,  0,  0,  0,  0]])

In [53]:
data0.take([5,2,0], axis=1)

array([[ 0,  0, 99],
       [ 1,  1,  1],
       [ 2, 99,  2],
       [ 3,  3,  3],
       [ 4,  4,  4],
       [99,  5,  5],
       [ 6,  6,  6]])

In [54]:
data0

array([[99,  0,  0,  0,  0,  0,  0],
       [ 1, 99,  1,  1,  1,  1,  1],
       [ 2,  2, 99,  2,  2,  2,  2],
       [ 3,  3,  3, 99,  3,  3,  3],
       [ 4,  4,  4,  4, 99,  4,  4],
       [ 5,  5,  5,  5,  5, 99,  5],
       [ 6,  6,  6,  6,  6,  6, 99]])

In [55]:
arr1.shape

(3, 6)

In [56]:
arr4 = arr1.reshape(2,9)
arr4.shape

(2, 9)

In [57]:
arr5 = np.array([[1, 3, 5, 7, 9], [2, 4, 6, 8, 10], [11, 13, 15, 17, 19]])
arr5

array([[ 1,  3,  5,  7,  9],
       [ 2,  4,  6,  8, 10],
       [11, 13, 15, 17, 19]])

In [58]:
arr5.T

array([[ 1,  2, 11],
       [ 3,  4, 13],
       [ 5,  6, 15],
       [ 7,  8, 17],
       [ 9, 10, 19]])

In [59]:
arr5.transpose()

array([[ 1,  2, 11],
       [ 3,  4, 13],
       [ 5,  6, 15],
       [ 7,  8, 17],
       [ 9, 10, 19]])

In [60]:
arr5.swapaxes(0, 1)

array([[ 1,  2, 11],
       [ 3,  4, 13],
       [ 5,  6, 15],
       [ 7,  8, 17],
       [ 9, 10, 19]])

In [61]:
arr5

array([[ 1,  3,  5,  7,  9],
       [ 2,  4,  6,  8, 10],
       [11, 13, 15, 17, 19]])

In [62]:
arr5[0]

array([1, 3, 5, 7, 9])

In [63]:
arr5 - arr5[0]      # not just operate on the first row but EVERY row!

array([[ 0,  0,  0,  0,  0],
       [ 1,  1,  1,  1,  1],
       [10, 10, 10, 10, 10]])

In [64]:
arr5 - np.array([1, 3, 5, 7, 9])     # so this is the same as below...

array([[ 0,  0,  0,  0,  0],
       [ 1,  1,  1,  1,  1],
       [10, 10, 10, 10, 10]])

In [65]:
arr5 - np.array([[1, 3, 5, 7, 9], [1, 3, 5, 7, 9], [1, 3, 5, 7, 9]])

array([[ 0,  0,  0,  0,  0],
       [ 1,  1,  1,  1,  1],
       [10, 10, 10, 10, 10]])

In [66]:
arr6 = np.array([[1, 2, 3], [4, 5, 6]])
arr7 = np.array([[7, 8, 9], [10, 11, 12]])
print(arr6, '\n\n', arr7)

[[1 2 3]
 [4 5 6]]

 [[ 7  8  9]
 [10 11 12]]

In [67]:
np.concatenate([arr6, arr7])    # .concatenate([]) rows on rows (by default) ---or--- 
                                # .vstack([]) ---or---
                                # .r_[]

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [68]:
np.vstack([arr6, arr7])         # same as above...

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [69]:
np.r_[arr6, arr7]               # same as above...

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [70]:
np.concatenate([arr6, arr7], axis=1)

array([[ 1,  2,  3,  7,  8,  9],
       [ 4,  5,  6, 10, 11, 12]])

In [71]:
np.hstack([arr6, arr7])

array([[ 1,  2,  3,  7,  8,  9],
       [ 4,  5,  6, 10, 11, 12]])

In [72]:
np.c_[arr6, arr7]

array([[ 1,  2,  3,  7,  8,  9],
       [ 4,  5,  6, 10, 11, 12]])

In [73]:
arr8 = np.random.randint(0,99, (9,7))
arr8

array([[72, 53, 24, 65, 10,  9, 85],
       [85, 83, 67, 48, 36, 13, 53],
       [ 7, 44,  7, 60, 30, 55, 34],
       [94, 75, 15, 64,  7, 12, 36],
       [97, 63, 36, 62, 56, 46, 14],
       [67, 89, 89, 64, 18, 10, 17],
       [98, 22, 33, 28, 41, 38, 53],
       [13, 67, 26, 30, 90, 78, 57],
       [66, 62, 66, 92, 78, 42,  3]])

In [74]:
np.split(arr8, [1,4])         # split to arr[:1], arr[1:4], arr[4:], default on rows
#np.split()
# vertical split does the same...
#np.vsplit(arr8, [1,4])

[array([[72, 53, 24, 65, 10,  9, 85]]),
 array([[85, 83, 67, 48, 36, 13, 53],
        [ 7, 44,  7, 60, 30, 55, 34],
        [94, 75, 15, 64,  7, 12, 36]]),
 array([[97, 63, 36, 62, 56, 46, 14],
        [67, 89, 89, 64, 18, 10, 17],
        [98, 22, 33, 28, 41, 38, 53],
        [13, 67, 26, 30, 90, 78, 57],
        [66, 62, 66, 92, 78, 42,  3]])]

In [75]:
np.split(arr8, [3])           # need a list [] (i.e. indexing with a sub)! 
                              # for split by position

[array([[72, 53, 24, 65, 10,  9, 85],
        [85, 83, 67, 48, 36, 13, 53],
        [ 7, 44,  7, 60, 30, 55, 34]]),
 array([[94, 75, 15, 64,  7, 12, 36],
        [97, 63, 36, 62, 56, 46, 14],
        [67, 89, 89, 64, 18, 10, 17],
        [98, 22, 33, 28, 41, 38, 53],
        [13, 67, 26, 30, 90, 78, 57],
        [66, 62, 66, 92, 78, 42,  3]])]

In [76]:
np.split(arr8, 3)             # ...otherwise, split to equal number of divisions!

[array([[72, 53, 24, 65, 10,  9, 85],
        [85, 83, 67, 48, 36, 13, 53],
        [ 7, 44,  7, 60, 30, 55, 34]]),
 array([[94, 75, 15, 64,  7, 12, 36],
        [97, 63, 36, 62, 56, 46, 14],
        [67, 89, 89, 64, 18, 10, 17]]),
 array([[98, 22, 33, 28, 41, 38, 53],
        [13, 67, 26, 30, 90, 78, 57],
        [66, 62, 66, 92, 78, 42,  3]])]

In [77]:
# list unpacking:
arr8_1, arr8_2, arr8_3 = np.split(arr8, [1,4])
print(arr8_1, '\n\n', arr8_2, '\n\n', arr8_3)

# pd.Series(arr8_1) will return an error!! 
# because this array is multi-dimensional with list in a list [[]]! So, instead:
pd.DataFrame(arr8_1)

[[72 53 24 65 10  9 85]]

 [[85 83 67 48 36 13 53]
 [ 7 44  7 60 30 55 34]
 [94 75 15 64  7 12 36]]

 [[97 63 36 62 56 46 14]
 [67 89 89 64 18 10 17]
 [98 22 33 28 41 38 53]
 [13 67 26 30 90 78 57]
 [66 62 66 92 78 42  3]]

    0   1   2   3   4  5   6
0  72  53  24  65  10  9  85

In [78]:
#np.split(arr8, [1,4], axis=1)
#np.hsplit(arr8, [1,4])
pd.DataFrame(np.hsplit(arr8, [1])[0])

    0
0  72
1  85
2   7
3  94
4  97
5  67
6  98
7  13
8  66

# Pandas Series

In [79]:
print(data1)
pd.Series(data1)

[6, 7.7, 8, 0, 1]

0    6.0
1    7.7
2    8.0
3    0.0
4    1.0
dtype: float64

In [80]:
s1 = pd.Series(data1, index=['d','c','a','g','f'])
s1

d    6.0
c    7.7
a    8.0
g    0.0
f    1.0
dtype: float64

In [81]:
s1.reset_index(drop=True)

0    6.0
1    7.7
2    8.0
3    0.0
4    1.0
dtype: float64

In [82]:
s2_df = s1.reset_index()
s2_df

  index    0
0     d  6.0
1     c  7.7
2     a  8.0
3     g  0.0
4     f  1.0

In [83]:
s1

d    6.0
c    7.7
a    8.0
g    0.0
f    1.0
dtype: float64

In [84]:
type(s2_df)

pandas.core.frame.DataFrame

In [85]:
type(s1)

pandas.core.series.Series

In [86]:
s1.reset_index(drop=True, inplace=True)
s1

0    6.0
1    7.7
2    8.0
3    0.0
4    1.0
dtype: float64

In [87]:
type(s1)

pandas.core.series.Series

In [88]:
pd.Series([1, 2, 3, None])

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [89]:
pd.Series([1, 2, 3, np.nan])

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [90]:
data3 = {'Ohio': 300, 'Texas': 621, 'Oregon': 290, 'Utah': 543}
pd.Series(data3)

Ohio      300
Texas     621
Oregon    290
Utah      543
dtype: int64

In [91]:
pd.Series(data3, index=['Ohio', 'Texas', 'Oregon', 'California'])
# non-matching index returns NaN

Ohio          300.0
Texas         621.0
Oregon        290.0
California      NaN
dtype: float64

In [92]:
data4 = [300, 621, 290, 543]
s3 = pd.Series(data4, index=['Ohio', 'Texas', 'Oregon', 'Utah'])
s3

Ohio      300
Texas     621
Oregon    290
Utah      543
dtype: int64

In [93]:
s3.values

array([300, 621, 290, 543])

In [94]:
s3.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

In [95]:
s3.name = 'a'
s3.all

<bound method Series.all of Ohio      300
Texas     621
Oregon    290
Utah      543
Name: a, dtype: int64>

In [96]:
s3.index.name = 'b'
s3.all

<bound method Series.all of b
Ohio      300
Texas     621
Oregon    290
Utah      543
Name: a, dtype: int64>

In [97]:
s3.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object', name='b')

In [98]:
s3[2]

290

In [99]:
s3['Oregon']

290

In [100]:
s3.iloc[2]

290

In [101]:
s3.loc['Oregon']

290

In [102]:
s3[['Utah', 'Oregon', 'Ohio']]     # put the indexes in a list first!!

b
Utah      543
Oregon    290
Ohio      300
Name: a, dtype: int64

In [103]:
s3.loc[['Utah', 'Oregon', 'Ohio']]

b
Utah      543
Oregon    290
Ohio      300
Name: a, dtype: int64

In [104]:
s3[[3,2,0]]

b
Utah      543
Oregon    290
Ohio      300
Name: a, dtype: int64

In [105]:
s3[1:3]                 # numbered range indexing DOESN'T include the end

b
Texas     621
Oregon    290
Name: a, dtype: int64

In [106]:
s3['Texas':'Utah']      # lettered range indexing DOES include the end!!

b
Texas     621
Oregon    290
Utah      543
Name: a, dtype: int64

In [107]:
data7 = [{'a': 120, 'c': 240, 'f': 360, 'd': 480, 'e': 600, 'b': 720},
         {'x': 200, 'y': 400, 'z': 600}]
pd.Series(data7)

0    {'a': 120, 'c': 240, 'f': 360, 'd': 480, 'e': ...
1                       {'x': 200, 'y': 400, 'z': 600}
dtype: object

In [108]:
pd.DataFrame(data7)

       a      c      f      d      e      b      x      y      z
0  120.0  240.0  360.0  480.0  600.0  720.0    NaN    NaN    NaN
1    NaN    NaN    NaN    NaN    NaN    NaN  200.0  400.0  600.0

In [109]:
s4 = pd.Series(data7[0])
s4

a    120
c    240
f    360
d    480
e    600
b    720
dtype: int64

In [110]:
s4[0:1]         # end EX-clusive

a    120
dtype: int64

In [111]:
s4['a':'b']     # end IN-clusive, 
                # print out by id order, not necessarily alphabetical!

a    120
c    240
f    360
d    480
e    600
b    720
dtype: int64

In [112]:
s4['a':'c']

a    120
c    240
dtype: int64

In [113]:
s4 > 500

a    False
c    False
f    False
d    False
e     True
b     True
dtype: bool

In [114]:
s4[s4 > 500]     # obj Series refers to its values by default

e    600
b    720
dtype: int64

In [115]:
s4[s4.values > 500]

e    600
b    720
dtype: int64

In [116]:
s4[s4.index > 'd']     # still print out by id order,
                       # but filter is alphabetical, not by id sequence

f    360
e    600
dtype: int64

In [117]:
for i in range(-2,0):
    print(s4.iloc[i])

600
720

In [118]:
s4[s4 < 0]       # none is True so return an empty Series

Series([], dtype: int64)

In [119]:
s5 = pd.Series({'I': 'lower?', 'II': 'b', 'III': 'D', 'IV': 'd', 'V': 'e'})
s5

I      lower?
II          b
III         D
IV          d
V           e
dtype: object

In [120]:
s5[s5 > 'd']     # letters can also be ordered

I    lower?
V         e
dtype: object

In [121]:
pd.concat([s3, s4])         # need a list [] to concat!
#s3.append(s4)

Ohio      300
Texas     621
Oregon    290
Utah      543
a         120
c         240
f         360
d         480
e         600
b         720
dtype: int64

In [122]:
pd.concat([s3, s4], keys=['s3','s4'])

    b
s3  Ohio      300
    Texas     621
    Oregon    290
    Utah      543
s4  a         120
    c         240
    f         360
    d         480
    e         600
    b         720
dtype: int64

In [123]:
pd.DataFrame(pd.concat([s3, s4], keys=['s3','s4']))

             0
   b
s3 Ohio    300
   Texas   621
   Oregon  290
   Utah    543
s4 a       120
   c       240
   f       360
   d       480
   e       600
   b       720

In [124]:
s3.combine_first(s4)     # combine also concatenates, but...
                         # it first sorts ids (indexes) alphabetically for each element!

Ohio      300.0
Oregon    290.0
Texas     621.0
Utah      543.0
a         120.0
b         720.0
c         240.0
d         480.0
e         600.0
f         360.0
Name: a, dtype: float64

In [125]:
s4.combine_first(s3)

Ohio      300.0
Oregon    290.0
Texas     621.0
Utah      543.0
a         120.0
b         720.0
c         240.0
d         480.0
e         600.0
f         360.0
dtype: float64

In [126]:
s3.combine(s4, max)

Ohio      300.0
Oregon    290.0
Texas     621.0
Utah      543.0
a           NaN
b           NaN
c           NaN
d           NaN
e           NaN
f           NaN
dtype: float64

In [127]:
s4.combine(s3, max)

Ohio        NaN
Oregon      NaN
Texas       NaN
Utah        NaN
a         120.0
b         720.0
c         240.0
d         480.0
e         600.0
f         360.0
dtype: float64

In [128]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [129]:
list(pd.Series([1, 2, 3, 4, 5]))

[1, 2, 3, 4, 5]

In [130]:
list(pd.Series([1, 2, 3, 4, 5]).iteritems())
# iterative is a list of tuples - (index, value)

[(0, 1), (1, 2), (2, 3), (3, 4), (4, 5)]

In [131]:
s4

a    120
c    240
f    360
d    480
e    600
b    720
dtype: int64

In [132]:
list(s4)

[120, 240, 360, 480, 600, 720]

In [133]:
list(s4.iteritems())

[('a', 120), ('c', 240), ('f', 360), ('d', 480), ('e', 600), ('b', 720)]

In [134]:
for i, v in s4.iteritems():
    s4[i] = s4[i] + 5
    print((i, v))
s4

('a', 120)
('c', 240)
('f', 360)
('d', 480)
('e', 600)
('b', 720)

a    125
c    245
f    365
d    485
e    605
b    725
dtype: int64

In [135]:
# ...or, a better (faster) way to do this is simply:
s4 = s4 + 5
s4

a    130
c    250
f    370
d    490
e    610
b    730
dtype: int64

# Pandas DataFrame

In [136]:
data5 = {'State':['Ohio', 'Texas'], 
         'Year': [2000, 2000], 
         'Popul': [300, 400]}
pd.DataFrame(data5)

   State  Year  Popul
0   Ohio  2000    300
1  Texas  2000    400

In [137]:
print(data1)
print('\n')
print(pd.Series(data1))
pd.DataFrame(data1)

[6, 7.7, 8, 0, 1]


0    6.0
1    7.7
2    8.0
3    0.0
4    1.0
dtype: float64

     0
0  6.0
1  7.7
2  8.0
3  0.0
4  1.0

In [138]:
print(data2)
print('\n')
print(pd.Series(data2))
pd.DataFrame(data2)

[[1, 2, 3, 4], [5, 6, 7, 8]]


0    [1, 2, 3, 4]
1    [5, 6, 7, 8]
dtype: object

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [139]:
pd.DataFrame(data2, 
             index=['row_I', 'row_II'], 
             columns=['col_I', 'col_II', 'col_III', 'col_IV'])

        col_I  col_II  col_III  col_IV
row_I       1       2        3       4
row_II      5       6        7       8

In [140]:
print(data3)
print('\n')
print(pd.Series(data3))
# pd.DataFrame(data3) will return a traceback!! 
# to fix this:
  # either: put lists in the dict
  # or: add an index parameter

{'Ohio': 300, 'Texas': 621, 'Oregon': 290, 'Utah': 543}


Ohio      300
Texas     621
Oregon    290
Utah      543
dtype: int64

In [141]:
pd.DataFrame(data3, index=['row_I',])
# the index has to be a list even when only one row

       Ohio  Texas  Oregon  Utah
row_I   300    621     290   543

In [142]:
print(data5)
pd.DataFrame(data5)

{'State': ['Ohio', 'Texas'], 'Year': [2000, 2000], 'Popul': [300, 400]}

   State  Year  Popul
0   Ohio  2000    300
1  Texas  2000    400

In [143]:
df1 = pd.DataFrame(data3, index=[1,])             
# index can either be an int 1 or a str '1' 
df1 = df1.append(pd.DataFrame(data3, index=[0]))  
# index can be explicit with a ',' to indicate a list
df1

   Ohio  Texas  Oregon  Utah
1   300    621     290   543
0   300    621     290   543

In [144]:
df0 = pd.DataFrame(data2)

df1.append(df0)
print(df1)      
print('append to dataframes does not change the original dataframe!')

print(df0)
print('------------------------')

df2 = df1.append(df0)       # no inplace=True parameter for append!
print(df2)

   Ohio  Texas  Oregon  Utah
1   300    621     290   543
0   300    621     290   543
append to dataframes does not change the original dataframe!
   0  1  2  3
0  1  2  3  4
1  5  6  7  8
------------------------
     0    1    2    3   Ohio  Oregon  Texas   Utah
1  NaN  NaN  NaN  NaN  300.0   290.0  621.0  543.0
0  NaN  NaN  NaN  NaN  300.0   290.0  621.0  543.0
0  1.0  2.0  3.0  4.0    NaN     NaN    NaN    NaN
1  5.0  6.0  7.0  8.0    NaN     NaN    NaN    NaN

In [145]:
pd.merge(df0, df1, how='outer', left_index=True, right_index=True)

   0  1  2  3  Ohio  Texas  Oregon  Utah
0  1  2  3  4   300    621     290   543
1  5  6  7  8   300    621     290   543

In [146]:
# merge doesn't modify the original dataframes
print(df0)
print('-----------------')
print(df1)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
-----------------
   Ohio  Texas  Oregon  Utah
1   300    621     290   543
0   300    621     290   543

In [147]:
df0.merge(df1, how='outer', left_index=True, right_index=True)

   0  1  2  3  Ohio  Texas  Oregon  Utah
0  1  2  3  4   300    621     290   543
1  5  6  7  8   300    621     290   543

In [148]:
# two ways to merge - again, neither modifies the original dataframes
print(df0)
print('-----------------')
print(df1)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
-----------------
   Ohio  Texas  Oregon  Utah
1   300    621     290   543
0   300    621     290   543

In [149]:
print(pd.DataFrame(data1))
print('-----------------')
print(pd.DataFrame(data2))
pd.DataFrame(data1).append(pd.DataFrame(data2))

     0
0  6.0
1  7.7
2  8.0
3  0.0
4  1.0
-----------------
   0  1  2  3
0  1  2  3  4
1  5  6  7  8

     0    1    2    3
0  6.0  NaN  NaN  NaN
1  7.7  NaN  NaN  NaN
2  8.0  NaN  NaN  NaN
3  0.0  NaN  NaN  NaN
4  1.0  NaN  NaN  NaN
0  1.0  2.0  3.0  4.0
1  5.0  6.0  7.0  8.0

In [150]:
pd.DataFrame({'a': [1, 2, 3, 4, 5], 'b': [5, 4, 3, 2, 1], 'c': [2, 4, 6, 8, 10]}, 
             index=[7, 8, 19, 12, 45], 
             columns=['a', 'c', 'm', 'n', 'b', 'x'])

    a   c    m    n  b    x
7   1   2  NaN  NaN  5  NaN
8   2   4  NaN  NaN  4  NaN
19  3   6  NaN  NaN  3  NaN
12  4   8  NaN  NaN  2  NaN
45  5  10  NaN  NaN  1  NaN

In [151]:
data6 = {'Nevada':                    # this is the column
         {2001: 2.4, 2002: 2.9},      # these are not level 2 columns but a series in a row!
         'Ohio': 
         {2000: 1.5, 2001: 1.7, 2002: 3.6}}
df3 = pd.DataFrame(data6)
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [152]:
pd.DataFrame({'Nevada': 
         {2001: 2.4, 2002: 2.9}})

      Nevada
2001     2.4
2002     2.9

In [153]:
pd.Series({2001: 2.4, 2002: 2.9})

2001    2.4
2002    2.9
dtype: float64

In [154]:
pd.Series({'Nevada': 
           {2001: 2.4, 2002: 2.9}})

Nevada    {2001: 2.4, 2002: 2.9}
dtype: object

In [155]:
pd.DataFrame(data6).index     # can be printed using list

Int64Index([2001, 2002, 2000], dtype='int64')

Modify indexes of data6:

In [156]:
df4 = pd.DataFrame(data6, index=[1, 2009, 'asjdhk'])
df4

        Nevada  Ohio
1          NaN   NaN
2009       NaN   NaN
asjdhk     NaN   NaN

Reset indexes to DataFrame default:

In [157]:
df4_alt = df4.reset_index()
df4_alt

    index  Nevada  Ohio
0       1     NaN   NaN
1    2009     NaN   NaN
2  asjdhk     NaN   NaN

In [158]:
df4_alt1 = df4.set_index('Nevada')      # original index is gone...
df4_alt1

        Ohio
Nevada
NaN      NaN
NaN      NaN
NaN      NaN

In [159]:
df4_alt1['original index'] = df4.index
df4_alt1

        Ohio original index
Nevada
NaN      NaN              1
NaN      NaN           2009
NaN      NaN         asjdhk

In [160]:
df4.reset_index(drop=True, inplace=True)
df4

   Nevada  Ohio
0     NaN   NaN
1     NaN   NaN
2     NaN   NaN

Change default indexes to match df3:

In [161]:
df4.set_index(pd.Index([2001, 2002, 2000]), inplace=True)
df4

      Nevada  Ohio
2001     NaN   NaN
2002     NaN   NaN
2000     NaN   NaN

Now merge df4 with df3:

In [162]:
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [163]:
df3.merge(df4, left_index=True, right_index=True)

      Nevada_x  Ohio_x  Nevada_y  Ohio_y
2001       2.4     1.7       NaN     NaN
2002       2.9     3.6       NaN     NaN
2000       NaN     1.5       NaN     NaN

In [164]:
# need to add the on clause to merge the x(left)'s and y(right)'s
df3.merge(df4, on=['Nevada', 'Ohio'], left_index=True, right_index=True)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [165]:
df3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [166]:
df3.index.name = 'year'     # this assigns the index heading
df3.all

<bound method DataFrame.all of       Nevada  Ohio
year
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5>

In [167]:
df3 - df3.iloc[0]           # this operates on every row, not just iloc[0]

      Nevada  Ohio
year
2001     0.0   0.0
2002     0.5   1.9
2000     NaN  -0.2

In [168]:
list(df3.columns)

['Nevada', 'Ohio']

In [169]:
df3.Nevada

year
2001    2.4
2002    2.9
2000    NaN
Name: Nevada, dtype: float64

In [170]:
df3['Nevada']

year
2001    2.4
2002    2.9
2000    NaN
Name: Nevada, dtype: float64

In [171]:
df3

      Nevada  Ohio
year
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [172]:
df3.reset_index(inplace=True)
print(df3)

   year  Nevada  Ohio
0  2001     2.4   1.7
1  2002     2.9   3.6
2  2000     NaN   1.5

In [173]:
df3.shape

(3, 3)

In [174]:
df3.year

0    2001
1    2002
2    2000
Name: year, dtype: int64

In [175]:
list(df3.index)

[0, 1, 2]

In [176]:
df5 = pd.DataFrame([[3, 6, 9, 12, 15, 18], 
                    [5, 10, 15, 20, 25, 30], 
                    [8, 16, 24, 32, 40, 48], 
                    [12, 24, 36, 48, 60, 72]], 
                  index=['a3', 'b5', 'c8', 'd12'],
                  columns=['I', 'II', 'III', 'IV', 'V', 'VI'])
df5

      I  II  III  IV   V  VI
a3    3   6    9  12  15  18
b5    5  10   15  20  25  30
c8    8  16   24  32  40  48
d12  12  24   36  48  60  72

In [177]:
df5_alt = pd.DataFrame({'a3': [3, 6, 9, 12, 15, 18], 
                   'b5': [5, 10, 15, 20, 25, 30],
                   'c8': [8, 16, 24, 32, 40, 48],
                   'd12': [12, 24, 36, 48, 60, 72]},
                  index=['I', 'II', 'III', 'IV', 'V', 'VI'])
df5_alt

     a3  b5  c8  d12
I     3   5   8   12
II    6  10  16   24
III   9  15  24   36
IV   12  20  32   48
V    15  25  40   60
VI   18  30  48   72

In [178]:
df6 = df5.T
df6

     a3  b5  c8  d12
I     3   5   8   12
II    6  10  16   24
III   9  15  24   36
IV   12  20  32   48
V    15  25  40   60
VI   18  30  48   72

In [179]:
df5_alt == df6

       a3    b5    c8   d12
I    True  True  True  True
II   True  True  True  True
III  True  True  True  True
IV   True  True  True  True
V    True  True  True  True
VI   True  True  True  True

In [180]:
df5_alt is df6

False

In [181]:
df6['b5']

I       5
II     10
III    15
IV     20
V      25
VI     30
Name: b5, dtype: int64

In [182]:
df6[['b5', 'a3']]         # need a list for multi-indexing!

     b5  a3
I     5   3
II   10   6
III  15   9
IV   20  12
V    25  15
VI   30  18

In [183]:
df6['b5']['II']

10

In [184]:
df6[['b5','c8']]['c8']     # df6[['b5','c8']]['II'] will return an error

I       8
II     16
III    24
IV     32
V      40
VI     48
Name: c8, dtype: int64

In [185]:
df6.loc['II']         # df6['II'] will return an error as no such column

a3      6
b5     10
c8     16
d12    24
Name: II, dtype: int64

In [186]:
df6.iloc[1]           # df6[1] will return an error as no such column

a3      6
b5     10
c8     16
d12    24
Name: II, dtype: int64

In [187]:
df6.take([1])       
# take uses a list of row numbers (by default) and returns a DataFrame
# same as df6.take([1], axis=0)

    a3  b5  c8  d12
II   6  10  16   24

In [188]:
df6.take([1], axis=1)

     b5
I     5
II   10
III  15
IV   20
V    25
VI   30

In [189]:
df6[['b5']]     # need a list (even for a single column!) to get a DataFrame
                # as if.... df6[['b5', ]]

     b5
I     5
II   10
III  15
IV   20
V    25
VI   30

In [190]:
df6['b5']       # otherwise......

I       5
II     10
III    15
IV     20
V      25
VI     30
Name: b5, dtype: int64

In [191]:
type(df6['b5'])

pandas.core.series.Series

In [192]:
type(df6[['b5']])

pandas.core.frame.DataFrame

In [193]:
df6
# better ways to extract row(s) or column(s) or a combo using .iloc[ , ] or .loc[ , ]
#help(pd.DataFrame.iloc)
#help(pd.DataFrame.loc)

     a3  b5  c8  d12
I     3   5   8   12
II    6  10  16   24
III   9  15  24   36
IV   12  20  32   48
V    15  25  40   60
VI   18  30  48   72

In [194]:
#df6 
#-----------------effectively is 
#df6.iloc[:, :] 
#-----------------or 
#df6.loc[:, :]

In [195]:
df6.iloc[1:5, 1:3]             # end position EX-clusive!

     b5  c8
II   10  16
III  15  24
IV   20  32
V    25  40

In [196]:
df6.loc['II':'V', 'b5':'c8']    # end position IN-clusive!

     b5  c8
II   10  16
III  15  24
IV   20  32
V    25  40

In [197]:
df6.iloc[[1], :]      # need a list to return a DataFrame! 
                      # same as.... df6.take([1])

    a3  b5  c8  d12
II   6  10  16   24

In [198]:
df6.iloc[1, :]        # otherwise.....a Series

a3      6
b5     10
c8     16
d12    24
Name: II, dtype: int64

In [199]:
df6.loc[:, ['b5']]    # again, need a list to return a DataFrame
                      # even a dummy list for a single column!
                      # same as.... df6.take([1], axis=1) 
                      # .....or.... df6[['b5']]

     b5
I     5
II   10
III  15
IV   20
V    25
VI   30

In [200]:
print(df6.iloc[2, 1])
print('------------')
print(df6.loc['III', 'b5'])
print('------------')   # both same as below although reversed r/c order
print(df6['b5']['III'])

15
------------
15
------------
15

In [201]:
df6[df6 > 30]

     a3  b5    c8   d12
I   NaN NaN   NaN   NaN
II  NaN NaN   NaN   NaN
III NaN NaN   NaN  36.0
IV  NaN NaN  32.0  48.0
V   NaN NaN  40.0  60.0
VI  NaN NaN  48.0  72.0

In [202]:
df6 > 30

        a3     b5     c8    d12
I    False  False  False  False
II   False  False  False  False
III  False  False  False   True
IV   False  False   True   True
V    False  False   True   True
VI   False  False   True   True

In [203]:
df6[df6.values > 30]      # .values is okay to mask Series but NOT for DataFrames!

     a3  b5  c8  d12
III   9  15  24   36
IV   12  20  32   48
IV   12  20  32   48
V    15  25  40   60
V    15  25  40   60
VI   18  30  48   72
VI   18  30  48   72

In [204]:
df6.values > 30           # array of 7 x True's and hence 7 rows...

array([[False, False, False, False],
       [False, False, False, False],
       [False, False, False,  True],
       [False, False,  True,  True],
       [False, False,  True,  True],
       [False, False,  True,  True]])

In [205]:
df6

     a3  b5  c8  d12
I     3   5   8   12
II    6  10  16   24
III   9  15  24   36
IV   12  20  32   48
V    15  25  40   60
VI   18  30  48   72

In [206]:
df7 = df6[df6 >= 30]     # all False's turn into NaN - not filtered!
df7

     a3    b5    c8   d12
I   NaN   NaN   NaN   NaN
II  NaN   NaN   NaN   NaN
III NaN   NaN   NaN  36.0
IV  NaN   NaN  32.0  48.0
V   NaN   NaN  40.0  60.0
VI  NaN  30.0  48.0  72.0

In [207]:
df7.dropna(how='all', axis=0)
#help(pd.DataFrame.dropna)

     a3    b5    c8   d12
III NaN   NaN   NaN  36.0
IV  NaN   NaN  32.0  48.0
V   NaN   NaN  40.0  60.0
VI  NaN  30.0  48.0  72.0

In [208]:
df7.dropna(how='all', axis=1)

       b5    c8   d12
I     NaN   NaN   NaN
II    NaN   NaN   NaN
III   NaN   NaN  36.0
IV    NaN  32.0  48.0
V     NaN  40.0  60.0
VI   30.0  48.0  72.0

In [209]:
df8 = df7.dropna(how='all', axis=0).dropna(how='all', axis=1)
df8
# can't use a tuple for axis...

       b5    c8   d12
III   NaN   NaN  36.0
IV    NaN  32.0  48.0
V     NaN  40.0  60.0
VI   30.0  48.0  72.0

In [210]:
df8.notna()

        b5     c8   d12
III  False  False  True
IV   False   True  True
V    False   True  True
VI    True   True  True

In [211]:
df8.fillna('no value')

           b5        c8   d12
III  no value  no value  36.0
IV   no value        32  48.0
V    no value        40  60.0
VI         30        48  72.0

In [212]:
df8.fillna('no value').isna()

        b5     c8    d12
III  False  False  False
IV   False  False  False
V    False  False  False
VI   False  False  False

In [213]:
df8.fillna('no value').isnull()

        b5     c8    d12
III  False  False  False
IV   False  False  False
V    False  False  False
VI   False  False  False

In [214]:
df8.apply(np.nanmax, axis=1)                   # this doesn't get added into df8!

III    36.0
IV     48.0
V      60.0
VI     72.0
dtype: float64

In [215]:
df8['_max'] = df8.apply(np.nanmax, axis=1)     # need to use assign to add a column to df8
df8
#help(pd.DataFrame.apply)

       b5    c8   d12  _max
III   NaN   NaN  36.0  36.0
IV    NaN  32.0  48.0  48.0
V     NaN  40.0  60.0  60.0
VI   30.0  48.0  72.0  72.0

In [216]:
df8.loc['_max'] = df8.apply(np.nanmax, axis=0)  # apply works across rows by default
                                                # and returns results col by col as a Series
df8

        b5    c8   d12  _max
III    NaN   NaN  36.0  36.0
IV     NaN  32.0  48.0  48.0
V      NaN  40.0  60.0  60.0
VI    30.0  48.0  72.0  72.0
_max  30.0  48.0  72.0  72.0

In [217]:
s6 = pd.Series(np.random.randint(80, size=(12)),
                index=[['a', 'a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd', 'd'],
                       [1, 2, 3, 4, 1, 2, 3, 1, 2, 1, 2, 3]])
s6

a  1     0
   2    60
   3    31
   4    52
b  1    30
   2    77
   3    55
c  1    23
   2    12
d  1    47
   2    62
   3    11
dtype: int64

In [218]:
df9 = s6.unstack()
df9

      1     2     3     4
a   0.0  60.0  31.0  52.0
b  30.0  77.0  55.0   NaN
c  23.0  12.0   NaN   NaN
d  47.0  62.0  11.0   NaN

In [219]:
s7 = df9.unstack()
s7

1  a     0.0
   b    30.0
   c    23.0
   d    47.0
2  a    60.0
   b    77.0
   c    12.0
   d    62.0
3  a    31.0
   b    55.0
   c     NaN
   d    11.0
4  a    52.0
   b     NaN
   c     NaN
   d     NaN
dtype: float64

In [220]:
df10 = s7.unstack()
df10

      a     b     c     d
1   0.0  30.0  23.0  47.0
2  60.0  77.0  12.0  62.0
3  31.0  55.0   NaN  11.0
4  52.0   NaN   NaN   NaN

In [221]:
df10.unstack()

a  1     0.0
   2    60.0
   3    31.0
   4    52.0
b  1    30.0
   2    77.0
   3    55.0
   4     NaN
c  1    23.0
   2    12.0
   3     NaN
   4     NaN
d  1    47.0
   2    62.0
   3    11.0
   4     NaN
dtype: float64

In [222]:
df11 = pd.DataFrame(np.random.rand(4,5),
                   index=['I', 'II', 'III', 'IV'], 
                   columns=['A', 'B', 'C', 'D', 'E'])
df11

            A         B         C         D         E
I    0.911040  0.469557  0.376266  0.191314  0.361423
II   0.164817  0.439111  0.214755  0.581170  0.967886
III  0.374728  0.543826  0.964217  0.149063  0.838526
IV   0.593155  0.210960  0.158271  0.267864  0.017919

In [223]:
df11.mean()            # by default these work on rows, for each column

A    0.510935
B    0.415863
C    0.428377
D    0.297353
E    0.546439
dtype: float64

In [224]:
np.mean(df11)          # same operation as above...

A    0.510935
B    0.415863
C    0.428377
D    0.297353
E    0.546439
dtype: float64

In [225]:
df11.mean(axis=1)      # specify a 1 to work on columns, for each row

I      0.461920
II     0.473548
III    0.574072
IV     0.249634
dtype: float64

In [226]:
df11.mean(1)

I      0.461920
II     0.473548
III    0.574072
IV     0.249634
dtype: float64

In [227]:
df11.max()

A    0.911040
B    0.543826
C    0.964217
D    0.581170
E    0.967886
dtype: float64

In [228]:
df11.idxmax()          # idx gives the id of the row(=0) or the column (=1)

A      I
B    III
C    III
D     II
E     II
dtype: object

In [229]:
df11.describe()        # .describe() only works on rows, for each column

              A         B         C         D         E
count  4.000000  4.000000  4.000000  4.000000  4.000000
mean   0.510935  0.415863  0.428377  0.297353  0.546439
std    0.318953  0.143507  0.368977  0.195496  0.438367
min    0.164817  0.210960  0.158271  0.149063  0.017919
25%    0.322250  0.382073  0.200634  0.180751  0.275547
50%    0.483942  0.454334  0.295510  0.229589  0.599975
75%    0.672626  0.488124  0.523254  0.346190  0.870866
max    0.911040  0.543826  0.964217  0.581170  0.967886

In [230]:
df11.T.describe()      # use a transpose to work on columns, for each row

              I        II       III        IV
count  5.000000  5.000000  5.000000  5.000000
mean   0.461920  0.473548  0.574072  0.249634
std    0.270384  0.323816  0.332955  0.213233
min    0.191314  0.164817  0.149063  0.017919
25%    0.361423  0.214755  0.374728  0.158271
50%    0.376266  0.439111  0.543826  0.210960
75%    0.469557  0.581170  0.838526  0.267864
max    0.911040  0.967886  0.964217  0.593155

In [231]:
df12 = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                    [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
df12

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [232]:
df12.dropna()

     0    1    2
0  1.0  6.5  3.0

In [233]:
df12.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [234]:
df12.fillna(99)

      0     1     2
0   1.0   6.5   3.0
1   1.0  99.0  99.0
2  99.0  99.0  99.0
3  99.0   6.5   3.0

In [235]:
df12.fillna({1: 11, 2: 22})

     0     1     2
0  1.0   6.5   3.0
1  1.0  11.0  22.0
2  NaN  11.0  22.0
3  NaN   6.5   3.0

In [236]:
df6

     a3  b5  c8  d12
I     3   5   8   12
II    6  10  16   24
III   9  15  24   36
IV   12  20  32   48
V    15  25  40   60
VI   18  30  48   72

In [237]:
df6['b5'] > 15

I      False
II     False
III    False
IV      True
V       True
VI      True
Name: b5, dtype: bool

In [238]:
df6[df6['b5'] > 15]       # the mask is applied across all and returns a DataFrame

    a3  b5  c8  d12
IV  12  20  32   48
V   15  25  40   60
VI  18  30  48   72

In [239]:
df6[df6['b5'] > 15]['b5']

IV    20
V     25
VI    30
Name: b5, dtype: int64

In [240]:
df6[df6['b5'] > 15]['b5'].mean()

25.0

In [241]:
df6.drop('a3', axis=1)

     b5  c8  d12
I     5   8   12
II   10  16   24
III  15  24   36
IV   20  32   48
V    25  40   60
VI   30  48   72

In [242]:
df6

     a3  b5  c8  d12
I     3   5   8   12
II    6  10  16   24
III   9  15  24   36
IV   12  20  32   48
V    15  25  40   60
VI   18  30  48   72

In [243]:
df6.columns

Index(['a3', 'b5', 'c8', 'd12'], dtype='object')

In [244]:
df6.columns = ['_a3', '_b5', '_c8', '_d12']
df6

     _a3  _b5  _c8  _d12
I      3    5    8    12
II     6   10   16    24
III    9   15   24    36
IV    12   20   32    48
V     15   25   40    60
VI    18   30   48    72

In [245]:
for i in df6.columns:
    i = i.upper()
    i = i.strip('_')
    print(i)
df6              # nope, changed i's aren't assigned back to df6.columns

A3
B5
C8
D12

     _a3  _b5  _c8  _d12
I      3    5    8    12
II     6   10   16    24
III    9   15   24    36
IV    12   20   32    48
V     15   25   40    60
VI    18   30   48    72

In [246]:
# ...to fix this:
df6.columns = [i.upper().strip('_') for i in df6.columns]
df6

     A3  B5  C8  D12
I     3   5   8   12
II    6  10  16   24
III   9  15  24   36
IV   12  20  32   48
V    15  25  40   60
VI   18  30  48   72

In [247]:
df6[(df6['B5'] > 10) & (df6['C8'] < 50)]

     A3  B5  C8  D12
III   9  15  24   36
IV   12  20  32   48
V    15  25  40   60
VI   18  30  48   72

In [248]:
df6[df6['B5'].isin(range(15,30))]

     A3  B5  C8  D12
III   9  15  24   36
IV   12  20  32   48
V    15  25  40   60

In [249]:
df6.rename(columns={'A3': '_A3'}, inplace=True)
df6

     _A3  B5  C8  D12
I      3   5   8   12
II     6  10  16   24
III    9  15  24   36
IV    12  20  32   48
V     15  25  40   60
VI    18  30  48   72

In [250]:
df6.rename(mapper={'_A3': '   A3   '}, axis=1, inplace=True)
df6

        A3     B5  C8  D12
I           3   5   8   12
II          6  10  16   24
III         9  15  24   36
IV         12  20  32   48
V          15  25  40   60
VI         18  30  48   72

In [251]:
df6.rename(mapper=str.strip, axis=1, inplace=True)
df6

     A3  B5  C8  D12
I     3   5   8   12
II    6  10  16   24
III   9  15  24   36
IV   12  20  32   48
V    15  25  40   60
VI   18  30  48   72

In [252]:
df6['A3'] = df6['A3'].map({3: 99, 6: 88, 9: 77, 12: 66})
df6

       A3  B5  C8  D12
I    99.0   5   8   12
II   88.0  10  16   24
III  77.0  15  24   36
IV   66.0  20  32   48
V     NaN  25  40   60
VI    NaN  30  48   72

In [253]:
df6 = df6.applymap(lambda x: x+2)
df6

        A3  B5  C8  D12
I    101.0   7  10   14
II    90.0  12  18   26
III   79.0  17  26   38
IV    68.0  22  34   50
V      NaN  27  42   62
VI     NaN  32  50   74

In [254]:
df6['mod1'] = df6.apply(lambda x: x['B5']+2, axis=1)
df6

        A3  B5  C8  D12  mod1
I    101.0   7  10   14   9.0
II    90.0  12  18   26  14.0
III   79.0  17  26   38  19.0
IV    68.0  22  34   50  24.0
V      NaN  27  42   62  29.0
VI     NaN  32  50   74  34.0

In [255]:
df13 = pd.DataFrame({'President': ['George Washington', 'John Adams', 'Thomas Jefferson', 'James Madison', 'James Monroe']})
df13

           President
0  George Washington
1         John Adams
2   Thomas Jefferson
3      James Madison
4       James Monroe

In [256]:
pattern = '(?P<First>[\w]+)(?:.* )(?P<Last>[\w]+)'
df14 = df13['President'].str.extract(pattern)
df14

    First        Last
0  George  Washington
1    John       Adams
2  Thomas   Jefferson
3   James     Madison
4   James      Monroe

In [257]:
df13['First'] = df14['First']
df13['Last'] = df14['Last']
df13

           President   First        Last
0  George Washington  George  Washington
1         John Adams    John       Adams
2   Thomas Jefferson  Thomas   Jefferson
3      James Madison   James     Madison
4       James Monroe   James      Monroe

In [258]:
#help(pd.Series.str)
# pd.Series.str.extract can work on regex
# pd.Series.replace can also work on regex

In [259]:
# (?P<#key>#value) to introduce a dict using regex
# (?:) to not capture those in the parenthesis

In [296]:
df15 = pd.DataFrame([[2,3,5],[7,3,1],[3,1,9],[2,5,3],[2,6,7],[7,5,8]],
                   index=['I','II','III','IV','V','VI'],
                   columns=['A','B','C'])
df15

     A  B  C
I    2  3  5
II   7  3  1
III  3  1  9
IV   2  5  3
V    2  6  7
VI   7  5  8

In [297]:
for group, frame in df15.groupby(by='A'):        # .groupby() returns a list of tuples
    print (group,'\n-------------------')
    print (frame,'\n-------------------')

#help(pd.DataFrame.groupby)

2
-------------------
    A  B  C
I   2  3  5
IV  2  5  3
V   2  6  7
-------------------
3
-------------------
     A  B  C
III  3  1  9
-------------------
7
-------------------
    A  B  C
II  7  3  1
VI  7  5  8
-------------------

In [298]:
df15.groupby('A').get_group(2)

    A  B  C
I   2  3  5
IV  2  5  3
V   2  6  7

In [301]:
# [df15.groupby('A').get_group(i) for i in df15.groupby('A').groups]       list comprehension
{i: df15.groupby('A').get_group(i) for i in df15.groupby('A').groups}    # dict comprehension

{2:     A  B  C
 I   2  3  5
 IV  2  5  3
 V   2  6  7,
 3:      A  B  C
 III  3  1  9,
 7:     A  B  C
 II  7  3  1
 VI  7  5  8}

In [302]:
df15.groupby('A').mean()

          B    C
A
2  4.666667  5.0
3  1.000000  9.0
7  4.000000  4.5

In [307]:
df15.groupby('A').agg('mean')

          B    C
A
2  4.666667  5.0
3  1.000000  9.0
7  4.000000  4.5

In [308]:
df15.groupby('A').agg(['mean'])

          B    C
       mean mean
A
2  4.666667  5.0
3  1.000000  9.0
7  4.000000  4.5

In [303]:
df15.groupby('A').agg(['mean', 'median'])
# doing a same list of things on all columns and aggregate - use list [] in .agg()

          B           C
       mean median mean median
A
2  4.666667      5  5.0    5.0
3  1.000000      1  9.0    9.0
7  4.000000      4  4.5    4.5

In [311]:
df15.groupby('A').agg({'B': ['median'], 'C': ['mean']})  
# doing different things on different columns and aggregate - use dict {} in .agg()

       B    C
  median mean
A
2      5  5.0
3      1  9.0
7      4  4.5

In [318]:
# df15.resample('A').agg('mean')
# WRONG! .resample only valid with index being DatetimeIndex, TimedeltaIndex or PeriodIndex
# help(pd.DataFrame.resample)
# then try matplotlib with <a series>.plot

In [262]:
df16 = pd.DataFrame(np.random.randint(1,8, (6,4)),
                   index=['I','II','III','IV','V','VI'],
                   columns=['A','B','C','D'])
df16

     A  B  C  D
I    6  1  5  3
II   2  6  2  1
III  3  7  2  5
IV   7  1  6  3
V    2  6  7  3
VI   7  1  4  3

In [263]:
for g,f in df16.groupby('A'):
    avg_B = np.average(f['B'])
    print('group of value {} in A has an average B value of {}'.format(g, avg_B))

group of value 2 in A has an average B value of 6.0
group of value 3 in A has an average B value of 7.0
group of value 6 in A has an average B value of 1.0
group of value 7 in A has an average B value of 1.0

In [264]:
def batch(g_item):
    if g_item < 1:
        return 'batch 1'
    if g_item < 3:
        return 'batch 2'
    if g_item < 5:
        return 'batch 3'
    return 'batch 4'

df16.set_index('A', inplace=True)    # when group by a function, the function 
                                     # automatically looks at the index column!
for g,f in df16.groupby(batch):      # hence we need to reset to the desired index first  
    rec = len(f)
    print('batch {} in A has {} records'.format(g, rec))

batch batch 2 in A has 2 records
batch batch 3 in A has 1 records
batch batch 4 in A has 3 records

In [265]:
def mask_to_df15(v):
    if v >= 3:
        return 5
    return v
df15 = df15.applymap(mask_to_df15)
df15

     A  B  C
I    2  5  5
II   5  5  1
III  5  1  5
IV   2  5  5
V    2  5  5
VI   5  5  5

In [266]:
df15.groupby('A').mean()

          B         C
A
2  5.000000  5.000000
5  3.666667  3.666667

In [267]:
df15_alt = df15.groupby('A').transform(np.mean)   # .transform works on the frame part of the groupby
df15_alt                                          # and returns that frame,
                                                  # which later can be merged to the original DataFrame

            B         C
I    5.000000  5.000000
II   3.666667  3.666667
III  3.666667  3.666667
IV   5.000000  5.000000
V    5.000000  5.000000
VI   3.666667  3.666667

In [268]:
df15_alt = df15_alt.rename(mapper={'B': 'avg_B_by_A', 'C': 'avg_C_by_A'}, axis=1)
df15_alt = round(df15_alt, 2)
df15_alt

     avg_B_by_A  avg_C_by_A
I          5.00        5.00
II         3.67        3.67
III        3.67        3.67
IV         5.00        5.00
V          5.00        5.00
VI         3.67        3.67

In [269]:
df15_alt1 = df15.merge(df15_alt, left_index=True, right_index=True)
df15_alt1

     A  B  C  avg_B_by_A  avg_C_by_A
I    2  5  5        5.00        5.00
II   5  5  1        3.67        3.67
III  5  1  5        3.67        3.67
IV   2  5  5        5.00        5.00
V    2  5  5        5.00        5.00
VI   5  5  5        3.67        3.67

In [270]:
df15_alt1.columns = ['A', 'B', 'avg_B_by_A', 'C', 'avg_C_by_A']
df15_alt1

     A  B  avg_B_by_A     C  avg_C_by_A
I    2  5           5  5.00        5.00
II   5  5           1  3.67        3.67
III  5  1           5  3.67        3.67
IV   2  5           5  5.00        5.00
V    2  5           5  5.00        5.00
VI   5  5           5  3.67        3.67

In [271]:
df15

     A  B  C
I    2  5  5
II   5  5  1
III  5  1  5
IV   2  5  5
V    2  5  5
VI   5  5  5

In [272]:
df15.groupby('A').filter(lambda x: x['B'].mean() > 4)    # .groupby().filter(), so it only works on row by row within each group
                                                         # works on the frame part of the groupby
                                                         # and returns the group(s) that match the filter

    A  B  C
I   2  5  5
IV  2  5  5
V   2  5  5

In [273]:
def get_mean(g_frame):                       # frame for each group from .groupby() below
    group_mean = np.mean(g_frame['B'])
    g_frame['avg_B_by_A'] = round(group_mean,2)
    return g_frame

df15.groupby('A').apply(get_mean)          # again, .groupby() then .apply() so it only works on row by row within each group
                                           # again, works on the frame part of each group 
                                           # and returns whatever the applied function calls!

     A  B  C  avg_B_by_A
I    2  5  5        5.00
II   5  5  1        3.67
III  5  1  5        3.67
IV   2  5  5        5.00
V    2  5  5        5.00
VI   5  5  5        3.67

In [274]:
df17 = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'],
                  index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 
                         'ok', 'ok', 'ok', 'poor', 'poor'],
                  columns=["Grades"])
df17

          Grades
excellent     A+
excellent      A
excellent     A-
good          B+
good           B
good          B-
ok            C+
ok             C
ok            C-
poor          D+
poor           D

In [275]:
df17[df17 > 'C'].dropna()          # NO! This is wrong because 'Grades' are not ordered by categorical scale

     Grades
ok       C+
ok       C-
poor     D+
poor      D

In [276]:
df17.dtypes

Grades    object
dtype: object

In [277]:
# now change Series.dtype to categorical but the ranking is not ordered by default
df17['Grades'].astype('category').dtype

CategoricalDtype(categories=['A', 'A+', 'A-', 'B', 'B+', 'B-', 'C', 'C+', 'C-', 'D',
                  'D+'],
                 ordered=False)

In [278]:
# now need to modify the category ranking and set ordered=True
my_category = pd.CategoricalDtype(categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 
                    'A+'],
                 ordered=True)
my_category

CategoricalDtype(categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A',
                  'A+'],
                 ordered=True)

In [279]:
# now apply AND ASSIGN! this - note: ('category') vs (my_category)
df17['Grades'] = df17['Grades'].astype(my_category)
df17['Grades'].dtype

CategoricalDtype(categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A',
                  'A+'],
                 ordered=True)

In [280]:
df17.dtypes

Grades    category
dtype: object

In [281]:
df17[df17 > 'C'].dropna()

          Grades
excellent     A+
excellent      A
excellent     A-
good          B+
good           B
good          B-
ok            C+